{"pageProps":{"post":{"title":"Sawasdee(Hello) Tadchud","date":"2022-09-14T05:35:07.322Z","slug":"how-tadchud-come-from","author":{"name":"Tar Jarupong","picture":"/assets/author/tar.jpeg"},"content":"<p>Hi folks. I&#39;m Tar who is a Full stupid developer at the studio team I have to learn a lot about DOM manipulation, basic canvas API, and some kinds of stuff which relates to 3d/2d. I&#39;m really fun to work on that and usually have new challenges (bugs) every day. Even though some bugs are hard to solve for example SVG from a merchant cannot render correctly in our studio, and the wrong position of placed 2d objects such as Text, Images, it cannot stop me learn how to develop cool features and improve existing functionality to increase performance and reduce funny bugs and loading time. Until now I had been working as a studio software engineer for one year. Sadly most of the time I used 3rd party library to solve those bugs until I got a ticket about cannot change SVG color fill by using that 3rd party, I have no idea how to fix it because I always use that library to render SVG on the 3D model. I had to go back to the basic concept of DOM manipulation to fix something inside the SVG element, Then I realize that I need more knowledge to develop harder features in the future. that I want to learn about WebGL, Canvas API, Real-time rendering, and Game development on the web. Tadchud is kind of my approval and achievement to break my knowledge limitation.</p>\n<h4 id=\"whats-is-tadchud\">What&#39;s is Tadchud</h4>\n<p>Well, in the Thai language it means <code>cut dress</code> or <code>dressmaker</code>. So I think it makes sense to name my product like this. Tadchud focus on online sellers who might not have their factory but want to take their creativity to make a real product. Let&#39;s say you want to custom your stuff eg shirt, bag. You have to talk with the merchant and explain what should it look like. So this is the <span style=\"color: red\"><strong>issue</strong></span> that Tadchud can solve. It can help you or your customers to bring the creativity to be a real product. We want to help both merchant and customer to be happy and take a shorter time to make things done.</p>\n<h3 id=\"technology-stack\">Technology stack</h3>\n<ul>\n<li>Frontend<ul>\n<li>NextJS(React) + Chakra UI</li>\n<li>Canvas API</li>\n<li>ThreeJS and BabylonJS for 3D rendering</li>\n</ul>\n</li>\n<li>Backend<ul>\n<li>Apollo Graphql server</li>\n<li>Prisma</li>\n</ul>\n</li>\n<li>Database<ul>\n<li>Postgresql</li>\n<li>Typesense(Search engine)</li>\n</ul>\n</li>\n</ul>\n","ogImage":{"url":"/assets/author/tar.jpeg"},"coverImage":"/assets/logo.svg","tags":["engineering"]}},"__N_SSG":true}